{"forum": [{"forumID": 1001, "userID": 1, "title": "I’m a teacher, and I can’t live like this.", "discussion": "In the United States, we have mandated that our children are physically present at school for a massive chunk of the time they spend awake. Children spend almost as many hours at school as they do at home. For the first two years of this pandemic, opinion columnists warned that we better get our children back into the school buildings for the sake of their mental health. The problem is teachers are not mental health professionals, and schools can’t or won’t budget for kids’ mental health needs. Nonetheless, children won’t thrive academically until their physiological and safety needs are met (e.g. food, housing, safety from bullying and other violence, etc.). We let shameful numbers of our children rot away in school all day, while horrified but largely helpless adults attempt to offer them something helpful. It’s maddening shit, soul-crushing shit. It’s low graduation rates, high teacher turn-over, increasingly dangerous staffing shortages, but somehow more police in the hallways. Children living in communities that’ve historically been targeted by state violence bear the brunt of it. Anyway here we are, three months back in the buildings full-time: School and district administrators are doing a bad job at the work public health administrators do, and teachers are doing a bad job at caring for children’s mental health. Predictably, kids are failing a lot of classes because they can’t figure out why they’re not motivated to do anything at all. Often they’re skipping classes and getting into all kinds of serious trouble. Some folks are calling for admin to hire a private security force to patrol the school… which is a whole other essay of NO."}], "reply": [{"replyID": 1001, "userID": 2, "message": "This is an interesting take you've got", "forumID": 1001}, {"replyID": 2, "userID": 2, "message": "Keep your spirits up!", "forumID": 1001}, {"replyID": 3, "userID": 1, "message": "Thanks", "forumID": 1001}], "catalog": [{"itemID": 1001, "name": "Casual Tee", "price": 90000, "desc": "Slim-fit t-shirt, comfortable to use for hot seasons, comes with different colors", "images": "https://image.uniqlo.com/UQ/ST3/id/imagesgoods/442868/item/idgoods_69_442868.jpg?width=1600&impolicy=quality_75", "size": "S,M,L", "redirectLink": "https://www.uniqlo.com/id/id/products/E442868-000?colorCode=COL69"}, {"itemID": 1002, "name": "Slip-on Sandal", "price": 25000, "desc": "Your regular sandals, simple yet stylish", "images": "https://dynamic.zacdn.com/K41wvLelb26jOfO4VSXSlnEjlPE=/fit-in/472x690/filters:quality(90):fill(ffffff)/https://static-id.zacdn.com/p/puma-6596-1092992-2.jpg", "size": "34,35,36", "redirectLink": "https://www.zalora.co.id/puma-fluff-remix-women-s-sandals-black-2992901.html"}]}